In [4]:
import pandas as pd

In [27]:
student_data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'David'],
    'Math': [85, 92, 78, 88],
    'Science': [91, 89, 84, 95],
    'English': [79, 85, 87, 90]
}
columns = ['a', 'b', 'c', 'd']

In [29]:
df = pd.DataFrame(student_data)
df

   Student  Math  Science  English
0    Alice    85       91       79
1      Bob    92       89       85
2  Charlie    78       84       87
3    David    88       95       90

In [30]:
df = pd.DataFrame(student_data, index=['a', 'b', 'c', 'd'])
df

   Student  Math  Science  English
a    Alice    85       91       79
b      Bob    92       89       85
c  Charlie    78       84       87
d    David    88       95       90

## Accessd column using `[ ]`

In [31]:
math_scores = df['Math']
math_scores

a    85
b    92
c    78
d    88
Name: Math, dtype: int64

## Accessd column using `.`

In [35]:
## Accessd column using `.`
science_scores = df.Science
science_scores

a    91
b    89
c    84
d    95
Name: Science, dtype: int64

## Multiple columns

In [37]:
df[['Math', 'English']]

   Math  English
a    85       79
b    92       85
c    78       87
d    88       90

In [38]:
# Get first 2 rows
df[0:2]

  Student  Math  Science  English
a   Alice    85       91       79
b     Bob    92       89       85

In [ ]:
# get row using .loc
df.loc['a']

Student    Alice
Math          85
Science       91
English       79
Name: a, dtype: object

In [41]:
# Get multiple rows from row: b to row: d
df['b':'d']

   Student  Math  Science  English
b      Bob    92       89       85
c  Charlie    78       84       87
d    David    88       95       90

In [43]:
# get row using .iloc
df.iloc[1]    # get second row

Student    Bob
Math        92
Science     89
English     85
Name: b, dtype: object

In [ ]:
# get row using .iloc
df.iloc[1:3]    # get second row to 3rd row

   Student  Math  Science  English
b      Bob    92       89       85
c  Charlie    78       84       87

In [46]:
# Get row b, c and column Math
df.loc['b':'c', 'Math']

b    92
c    78
Name: Math, dtype: int64

In [ ]:
# Get row a, c and column 2
df.iloc[[0,2], [2]]

   Science
a       91
c       84

In [49]:
# conditional filtering
df[ df['Math'] > 80]

  Student  Math  Science  English
a   Alice    85       91       79
b     Bob    92       89       85
d   David    88       95       90

In [50]:
# conditional filtering
df[ df['Math'] < 80]

   Student  Math  Science  English
c  Charlie    78       84       87

In [ ]:
# Multiple conditions filtering using &
df[ (df['Science'] > 90) & (df['Math'] > 80) ]

  Student  Math  Science  English
a   Alice    85       91       79
d   David    88       95       90

In [53]:
# Multiple conditions filtering using |
df[ (df['Science'] > 90) | (df['Math'] > 80) ]

  Student  Math  Science  English
a   Alice    85       91       79
b     Bob    92       89       85
d   David    88       95       90

In [ ]:
# filtering using .isin()
df['Student'].isin(['Alice'])

a     True
b    False
c    False
d    False
Name: Student, dtype: bool

In [ ]:
# filtering using .isin()
df[ df['Student'].isin(['Alice']) ]

  Student  Math  Science  English
a   Alice    85       91       79

In [56]:
# filtering using .where()
df.where( df[['Math', 'Science', 'English']] > 85)

  Student  Math  Science  English
a     NaN   NaN     91.0      NaN
b     NaN  92.0     89.0      NaN
c     NaN   NaN      NaN     87.0
d     NaN  88.0     95.0     90.0

In [ ]:
# Filtering using .where() and replace NaN with 0
df[['Math', 'Science', 'English']].where( df[['Math', 'Science', 'English']] > 85, 0 )

   Math  Science  English
a     0       91        0
b    92       89        0
c     0        0       87
d    88       95       90